CiscoDevNet/csmp-agent-lib/efr32_wisun/gecko_sdk_2024.6.0/platform/service/device_manager/inc/sl_device_abstraction_peripheral.h
/**************************************************************************//**
 * @file
 * @brief Device Manager API Definition
 ******************************************************************************
 * # License
 * <b>Copyright 2024 Silicon Laboratories, Inc. www.silabs.com</b>
 ******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *****************************************************************************/
#ifndef SL_DEVICE_ABSTRACTION_PERIPHERAL_H
#define SL_DEVICE_ABSTRACTION_PERIPHERAL_H

#include "sl_technology_abstraction_clock.h"

#ifdef __cplusplus
extern "C" {
#endif

/***************************************************************************//**
 * @addtogroup device_abstraction_peripheral Device Abstraction Peripheral
 * @{
 ******************************************************************************/

/*******************************************************************************
 *******************************   STRUCTS   ***********************************
 ******************************************************************************/

/// Define peripheral structure.
typedef struct sl_peripheral {
  uint32_t base;   ///< Peripheral base address. Non Secure address always.
  sl_clock_branch_t clk_branch;  ///< Peripheral clock branch.
  sl_bus_clock_t bus_clock;  ///< Peripheral bus clock.
} sl_peripheral_val_t;

/*******************************************************************************
 *******************************   EXTERNS   ***********************************
 ******************************************************************************/

/// External declaration for ACMP0 peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_acmp0;

/// External declaration for ACMP1 peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_acmp1;

/// External declaration for ADC0 peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_adc0;

/// External declaration for AES peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_aes;

/// External declaration for AMUXCP0 peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_amuxcp0;

/// External declaration for BUFC peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_bufc;

/// External declaration for BURAM peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_buram;

/// External declaration for BURTC peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_burtc;

/// External declaration for CMU peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_cmu;

/// External declaration for CRYPTOACC peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_cryptoacc;

/// External declaration for DCDC peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_dcdc;

/// External declaration for DEVINFO peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_devinfo;

/// External declaration for DMEM peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_dmem;

/// External declaration for DMEM0 peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_dmem0;

/// External declaration for DMEM1 peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_dmem1;

/// External declaration for DPLL0 peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_dpll0;

/// External declaration for EMU peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_emu;

/// External declaration for ETAMPDET peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_etampdet;

/// External declaration for EUART0 peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_euart0;

/// External declaration for EUSART0 peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_eusart0;

/// External declaration for EUSART1 peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_eusart1;

/// External declaration for EUSART2 peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_eusart2;

/// External declaration for EUSART3 peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_eusart3;

/// External declaration for EUSART4 peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_eusart4;

/// External declaration for FSRCO peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_fsrco;

/// External declaration for GPCRC0 peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_gpcrc0;

/// External declaration for GPIO peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_gpio;

/// External declaration for HFRCO0 peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_hfrco0;

/// External declaration for HFRCOEM23 peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_hfrcoem23;

/// External declaration for HFXO0 peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_hfxo0;

