CiscoDevNet/csmp-agent-lib/efr32_wisun/gecko_sdk_2024.6.0/platform/service/device_manager/inc/sl_device_abstraction_peripheral.h
/// External declaration for HOSTMAILBOX peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_hostmailbox;

/// External declaration for HOSTPORTAL peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_hostportal;

/// External declaration for I2C0 peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_i2c0;

/// External declaration for I2C1 peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_i2c1;

/// External declaration for I2C2 peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_i2c2;

/// External declaration for I2C3 peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_i2c3;

/// External declaration for IADC0 peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_iadc0;

/// External declaration for ICACHE0 peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_icache0;

/// External declaration for KEYSCAN peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_keyscan;

/// External declaration for L1ICACHE0 peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_l1icache0;

/// External declaration for L2ICACHE0 peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_l2icache0;

/// External declaration for LCD peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_lcd;

/// External declaration for LCDRF peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_lcdrf;

/// External declaration for LDMA0 peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_ldma0;

/// External declaration for LDMAXBAR0 peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_ldmaxbar0;

/// External declaration for LEDDRV0 peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_leddrv0;

/// External declaration for LESENSE peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_lesense;

/// External declaration for LETIMER0 peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_letimer0;

/// External declaration for LFRCO peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_lfrco;

/// External declaration for LFXO peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_lfxo;

/// External declaration for LPW0PORTAL peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_lpw0portal;

/// External declaration for LVGD peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_lvgd;

/// External declaration for MPAHBRAM peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_mpahbram;

/// External declaration for MSC peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_msc;

/// External declaration for MVP peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_mvp;

/// External declaration for PCNT0 peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_pcnt0;

/// External declaration for PDM peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_pdm;

/// External declaration for PFMXPPRF peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_pfmxpprf;

/// External declaration for PIXELRZ0 peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_pixelrz0;

/// External declaration for PIXELRZ1 peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_pixelrz1;

/// External declaration for PRORTC peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_prortc;

/// External declaration for PRS peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_prs;

/// External declaration for RADIOAES peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_radioaes;

/// External declaration for RFFPLL0 peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_rffpll0;

/// External declaration for RPA peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_rpa;

/// External declaration for RTCC peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_rtcc;

/// External declaration for SCRATCHPAD peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_scratchpad;

/// External declaration for SEMAILBOX peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_semailbox;

/// External declaration for SEMAPHORE0 peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_semaphore0;

/// External declaration for SEMAPHORE1 peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_semaphore1;

/// External declaration for SEPORTAL peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_seportal;

/// External declaration for SEPUF peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_sepuf;

/// External declaration for SOCPLL0 peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_socpll0;

/// External declaration for SYMCRYPTO peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_symcrypto;

/// External declaration for SYSCFG peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_syscfg;

/// External declaration for SYSRTC0 peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_sysrtc0;

/// External declaration for TIMER0 peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_timer0;

/// External declaration for TIMER1 peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_timer1;

/// External declaration for TIMER2 peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_timer2;

/// External declaration for TIMER3 peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_timer3;

/// External declaration for TIMER4 peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_timer4;

/// External declaration for TIMER5 peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_timer5;

/// External declaration for TIMER6 peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_timer6;

/// External declaration for TIMER7 peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_timer7;

/// External declaration for TIMER8 peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_timer8;

/// External declaration for TIMER9 peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_timer9;

