CiscoDevNet/csmp-agent-lib/efr32_wisun/gecko_sdk_2024.6.0/platform/service/device_manager/inc/sl_device_abstraction_peripheral.h
/// External declaration for ULFRCO peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_ulfrco;

/// External declaration for USART0 peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_usart0;

/// External declaration for USART1 peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_usart1;

/// External declaration for USART2 peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_usart2;

/// External declaration for USB peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_usb;

/// External declaration for USBAHB peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_usbahb;

/// External declaration for USBPLL0 peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_usbpll0;

/// External declaration for VDAC0 peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_vdac0;

/// External declaration for VDAC1 peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_vdac1;

/// External declaration for WDOG0 peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_wdog0;

/// External declaration for WDOG1 peripheral structure.
extern const sl_peripheral_val_t sl_peripheral_val_wdog1;

/*******************************************************************************
 ********************************   DEFINES   **********************************
 ******************************************************************************/

/// Secure address mask.
#define SL_SECURE_ADDR_MASK 0xEFFFFFFF

/// Macro to convert non-secure peripheral base address to secure address.
#define SL_GET_SECURE_ADDR(addr) (((uint32_t)addr) & SL_SECURE_ADDR_MASK)

/// Macro to convert secure peripheral base address to non-secure address.
#define SL_GET_NON_SECURE_ADDR(addr) (((uint32_t)addr) | ~SL_SECURE_ADDR_MASK)

/// Define pointer to ACMP0 peripheral structure.
#define SL_PERIPHERAL_ACMP0 (&sl_peripheral_val_acmp0)

/// Define pointer to ACMP1 peripheral structure.
#define SL_PERIPHERAL_ACMP1 (&sl_peripheral_val_acmp1)

/// Define pointer to ADC0 peripheral structure.
#define SL_PERIPHERAL_ADC0 (&sl_peripheral_val_adc0)

/// Define pointer to AES peripheral structure.
#define SL_PERIPHERAL_AES (&sl_peripheral_val_aes)

/// Define pointer to AMUXCP0 peripheral structure.
#define SL_PERIPHERAL_AMUXCP0 (&sl_peripheral_val_amuxcp0)

/// Define pointer to BUFC peripheral structure.
#define SL_PERIPHERAL_BUFC (&sl_peripheral_val_bufc)

/// Define pointer to BURAM peripheral structure.
#define SL_PERIPHERAL_BURAM (&sl_peripheral_val_buram)

/// Define pointer to BURTC peripheral structure.
#define SL_PERIPHERAL_BURTC (&sl_peripheral_val_burtc)

/// Define pointer to CMU peripheral structure.
#define SL_PERIPHERAL_CMU (&sl_peripheral_val_cmu)

/// Define pointer to CRYPTOACC peripheral structure.
#define SL_PERIPHERAL_CRYPTOACC (&sl_peripheral_val_cryptoacc)

/// Define pointer to DCDC peripheral structure.
#define SL_PERIPHERAL_DCDC (&sl_peripheral_val_dcdc)

/// Define pointer to DEVINFO peripheral structure.
#define SL_PERIPHERAL_DEVINFO (&sl_peripheral_val_devinfo)

/// Define pointer to DMEM peripheral structure.
#define SL_PERIPHERAL_DMEM (&sl_peripheral_val_dmem)

/// Define pointer to DMEM0 peripheral structure.
#define SL_PERIPHERAL_DMEM0 (&sl_peripheral_val_dmem0)

/// Define pointer to DMEM1 peripheral structure.
#define SL_PERIPHERAL_DMEM1 (&sl_peripheral_val_dmem1)

/// Define pointer to DPLL0 peripheral structure.
#define SL_PERIPHERAL_DPLL0 (&sl_peripheral_val_dpll0)

/// Define pointer to EMU peripheral structure.
#define SL_PERIPHERAL_EMU (&sl_peripheral_val_emu)

/// Define pointer to ETAMPDET peripheral structure.
#define SL_PERIPHERAL_ETAMPDET (&sl_peripheral_val_etampdet)

/// Define pointer to EUART0 peripheral structure.
#define SL_PERIPHERAL_EUART0 (&sl_peripheral_val_euart0)

/// Define pointer to EUSART0 peripheral structure.
#define SL_PERIPHERAL_EUSART0 (&sl_peripheral_val_eusart0)

/// Define pointer to EUSART1 peripheral structure.
#define SL_PERIPHERAL_EUSART1 (&sl_peripheral_val_eusart1)

/// Define pointer to EUSART2 peripheral structure.
#define SL_PERIPHERAL_EUSART2 (&sl_peripheral_val_eusart2)

/// Define pointer to EUSART3 peripheral structure.
#define SL_PERIPHERAL_EUSART3 (&sl_peripheral_val_eusart3)

/// Define pointer to EUSART4 peripheral structure.
#define SL_PERIPHERAL_EUSART4 (&sl_peripheral_val_eusart4)

/// Define pointer to FSRCO peripheral structure.
#define SL_PERIPHERAL_FSRCO (&sl_peripheral_val_fsrco)

/// Define pointer to GPCRC0 peripheral structure.
#define SL_PERIPHERAL_GPCRC0 (&sl_peripheral_val_gpcrc0)

/// Define pointer to GPIO peripheral structure.
#define SL_PERIPHERAL_GPIO (&sl_peripheral_val_gpio)

/// Define pointer to HFRCO0 peripheral structure.
#define SL_PERIPHERAL_HFRCO0 (&sl_peripheral_val_hfrco0)

/// Define pointer to HFRCOEM23 peripheral structure.
#define SL_PERIPHERAL_HFRCOEM23 (&sl_peripheral_val_hfrcoem23)

/// Define pointer to HFXO0 peripheral structure.
#define SL_PERIPHERAL_HFXO0 (&sl_peripheral_val_hfxo0)

/// Define pointer to HOSTMAILBOX peripheral structure.
#define SL_PERIPHERAL_HOSTMAILBOX (&sl_peripheral_val_hostmailbox)

/// Define pointer to HOSTPORTAL peripheral structure.
#define SL_PERIPHERAL_HOSTPORTAL (&sl_peripheral_val_hostportal)

/// Define pointer to I2C0 peripheral structure.
#define SL_PERIPHERAL_I2C0 (&sl_peripheral_val_i2c0)

/// Define pointer to I2C1 peripheral structure.
#define SL_PERIPHERAL_I2C1 (&sl_peripheral_val_i2c1)

/// Define pointer to I2C2 peripheral structure.
#define SL_PERIPHERAL_I2C2 (&sl_peripheral_val_i2c2)

/// Define pointer to I2C3 peripheral structure.
#define SL_PERIPHERAL_I2C3 (&sl_peripheral_val_i2c3)

/// Define pointer to IADC0 peripheral structure.
#define SL_PERIPHERAL_IADC0 (&sl_peripheral_val_iadc0)

/// Define pointer to ICACHE0 peripheral structure.
#define SL_PERIPHERAL_ICACHE0 (&sl_peripheral_val_icache0)

/// Define pointer to KEYSCAN peripheral structure.
#define SL_PERIPHERAL_KEYSCAN (&sl_peripheral_val_keyscan)

/// Define pointer to L1ICACHE0 peripheral structure.
#define SL_PERIPHERAL_L1ICACHE0 (&sl_peripheral_val_l1icache0)

/// Define pointer to L2ICACHE0 peripheral structure.
#define SL_PERIPHERAL_L2ICACHE0 (&sl_peripheral_val_l2icache0)

/// Define pointer to LCD peripheral structure.
#define SL_PERIPHERAL_LCD (&sl_peripheral_val_lcd)

/// Define pointer to LCDRF peripheral structure.
#define SL_PERIPHERAL_LCDRF (&sl_peripheral_val_lcdrf)

/// Define pointer to LDMA0 peripheral structure.
#define SL_PERIPHERAL_LDMA0 (&sl_peripheral_val_ldma0)

