CiscoDevNet/csmp-agent-lib/efr32_wisun/gecko_sdk_2024.6.0/platform/service/device_manager/inc/sl_device_abstraction_peripheral.h
/// Define pointer to LDMAXBAR0 peripheral structure.
#define SL_PERIPHERAL_LDMAXBAR0 (&sl_peripheral_val_ldmaxbar0)

/// Define pointer to LEDDRV0 peripheral structure.
#define SL_PERIPHERAL_LEDDRV0 (&sl_peripheral_val_leddrv0)

/// Define pointer to LESENSE peripheral structure.
#define SL_PERIPHERAL_LESENSE (&sl_peripheral_val_lesense)

/// Define pointer to LETIMER0 peripheral structure.
#define SL_PERIPHERAL_LETIMER0 (&sl_peripheral_val_letimer0)

/// Define pointer to LFRCO peripheral structure.
#define SL_PERIPHERAL_LFRCO (&sl_peripheral_val_lfrco)

/// Define pointer to LFXO peripheral structure.
#define SL_PERIPHERAL_LFXO (&sl_peripheral_val_lfxo)

/// Define pointer to LPW0PORTAL peripheral structure.
#define SL_PERIPHERAL_LPW0PORTAL (&sl_peripheral_val_lpw0portal)

/// Define pointer to LVGD peripheral structure.
#define SL_PERIPHERAL_LVGD (&sl_peripheral_val_lvgd)

/// Define pointer to MPAHBRAM peripheral structure.
#define SL_PERIPHERAL_MPAHBRAM (&sl_peripheral_val_mpahbram)

/// Define pointer to MSC peripheral structure.
#define SL_PERIPHERAL_MSC (&sl_peripheral_val_msc)

/// Define pointer to MVP peripheral structure.
#define SL_PERIPHERAL_MVP (&sl_peripheral_val_mvp)

/// Define pointer to PCNT0 peripheral structure.
#define SL_PERIPHERAL_PCNT0 (&sl_peripheral_val_pcnt0)

/// Define pointer to PDM peripheral structure.
#define SL_PERIPHERAL_PDM (&sl_peripheral_val_pdm)

/// Define pointer to PFMXPPRF peripheral structure.
#define SL_PERIPHERAL_PFMXPPRF (&sl_peripheral_val_pfmxpprf)

/// Define pointer to PIXELRZ0 peripheral structure.
#define SL_PERIPHERAL_PIXELRZ0 (&sl_peripheral_val_pixelrz0)

/// Define pointer to PIXELRZ1 peripheral structure.
#define SL_PERIPHERAL_PIXELRZ1 (&sl_peripheral_val_pixelrz1)

/// Define pointer to PRORTC peripheral structure.
#define SL_PERIPHERAL_PRORTC (&sl_peripheral_val_prortc)

/// Define pointer to PRS peripheral structure.
#define SL_PERIPHERAL_PRS (&sl_peripheral_val_prs)

/// Define pointer to RADIOAES peripheral structure.
#define SL_PERIPHERAL_RADIOAES (&sl_peripheral_val_radioaes)

/// Define pointer to RFFPLL0 peripheral structure.
#define SL_PERIPHERAL_RFFPLL0 (&sl_peripheral_val_rffpll0)

/// Define pointer to RPA peripheral structure.
#define SL_PERIPHERAL_RPA (&sl_peripheral_val_rpa)

/// Define pointer to RTCC peripheral structure.
#define SL_PERIPHERAL_RTCC (&sl_peripheral_val_rtcc)

/// Define pointer to SCRATCHPAD peripheral structure.
#define SL_PERIPHERAL_SCRATCHPAD (&sl_peripheral_val_scratchpad)

/// Define pointer to SEMAILBOX peripheral structure.
#define SL_PERIPHERAL_SEMAILBOX (&sl_peripheral_val_semailbox)

/// Define pointer to SEMAPHORE0 peripheral structure.
#define SL_PERIPHERAL_SEMAPHORE0 (&sl_peripheral_val_semaphore0)

/// Define pointer to SEMAPHORE1 peripheral structure.
#define SL_PERIPHERAL_SEMAPHORE1 (&sl_peripheral_val_semaphore1)

/// Define pointer to SEPORTAL peripheral structure.
#define SL_PERIPHERAL_SEPORTAL (&sl_peripheral_val_seportal)

/// Define pointer to SEPUF peripheral structure.
#define SL_PERIPHERAL_SEPUF (&sl_peripheral_val_sepuf)

/// Define pointer to SOCPLL0 peripheral structure.
#define SL_PERIPHERAL_SOCPLL0 (&sl_peripheral_val_socpll0)

/// Define pointer to SYMCRYPTO peripheral structure.
#define SL_PERIPHERAL_SYMCRYPTO (&sl_peripheral_val_symcrypto)

/// Define pointer to SYSCFG peripheral structure.
#define SL_PERIPHERAL_SYSCFG (&sl_peripheral_val_syscfg)

/// Define pointer to SYSRTC0 peripheral structure.
#define SL_PERIPHERAL_SYSRTC0 (&sl_peripheral_val_sysrtc0)

/// Define pointer to TIMER0 peripheral structure.
#define SL_PERIPHERAL_TIMER0 (&sl_peripheral_val_timer0)

/// Define pointer to TIMER1 peripheral structure.
#define SL_PERIPHERAL_TIMER1 (&sl_peripheral_val_timer1)

/// Define pointer to TIMER2 peripheral structure.
#define SL_PERIPHERAL_TIMER2 (&sl_peripheral_val_timer2)

/// Define pointer to TIMER3 peripheral structure.
#define SL_PERIPHERAL_TIMER3 (&sl_peripheral_val_timer3)

/// Define pointer to TIMER4 peripheral structure.
#define SL_PERIPHERAL_TIMER4 (&sl_peripheral_val_timer4)

/// Define pointer to TIMER5 peripheral structure.
#define SL_PERIPHERAL_TIMER5 (&sl_peripheral_val_timer5)

/// Define pointer to TIMER6 peripheral structure.
#define SL_PERIPHERAL_TIMER6 (&sl_peripheral_val_timer6)

/// Define pointer to TIMER7 peripheral structure.
#define SL_PERIPHERAL_TIMER7 (&sl_peripheral_val_timer7)

/// Define pointer to TIMER8 peripheral structure.
#define SL_PERIPHERAL_TIMER8 (&sl_peripheral_val_timer8)

/// Define pointer to TIMER9 peripheral structure.
#define SL_PERIPHERAL_TIMER9 (&sl_peripheral_val_timer9)

/// Define pointer to ULFRCO peripheral structure.
#define SL_PERIPHERAL_ULFRCO (&sl_peripheral_val_ulfrco)

/// Define pointer to USART0 peripheral structure.
#define SL_PERIPHERAL_USART0 (&sl_peripheral_val_usart0)

/// Define pointer to USART1 peripheral structure.
#define SL_PERIPHERAL_USART1 (&sl_peripheral_val_usart1)

/// Define pointer to USART2 peripheral structure.
#define SL_PERIPHERAL_USART2 (&sl_peripheral_val_usart2)

/// Define pointer to USB peripheral structure.
#define SL_PERIPHERAL_USB (&sl_peripheral_val_usb)

/// Define pointer to USBAHB peripheral structure.
#define SL_PERIPHERAL_USBAHB (&sl_peripheral_val_usbahb)

/// Define pointer to USBPLL0 peripheral structure.
#define SL_PERIPHERAL_USBPLL0 (&sl_peripheral_val_usbpll0)

/// Define pointer to VDAC0 peripheral structure.
#define SL_PERIPHERAL_VDAC0 (&sl_peripheral_val_vdac0)

/// Define pointer to VDAC1 peripheral structure.
#define SL_PERIPHERAL_VDAC1 (&sl_peripheral_val_vdac1)

/// Define pointer to WDOG0 peripheral structure.
#define SL_PERIPHERAL_WDOG0 (&sl_peripheral_val_wdog0)

/// Define pointer to WDOG1 peripheral structure.
#define SL_PERIPHERAL_WDOG1 (&sl_peripheral_val_wdog1)

/*******************************************************************************
 *******************************   TYPEDEFS   **********************************
 ******************************************************************************/

/// Define peripheral typedef.
typedef const sl_peripheral_val_t* sl_peripheral_t;

/// Declare peripheral structure for ACMP.
typedef struct acmp_typedef ACMP_TypeDef;

/// Declare peripheral structure for ADC.
typedef struct adc_typedef ADC_TypeDef;

