CiscoDevNet/csmp-agent-lib/efr32_wisun/gecko_sdk_2024.6.0/platform/service/device_manager/inc/sl_device_abstraction_peripheral.h
/// Declare peripheral structure for AES.
typedef struct aes_typedef AES_TypeDef;

/// Declare peripheral structure for AMUXCP.
typedef struct amuxcp_typedef AMUXCP_TypeDef;

/// Declare peripheral structure for BUFC.
typedef struct bufc_typedef BUFC_TypeDef;

/// Declare peripheral structure for BURAM.
typedef struct buram_typedef BURAM_TypeDef;

/// Declare peripheral structure for BURTC.
typedef struct burtc_typedef BURTC_TypeDef;

/// Declare peripheral structure for CMU.
typedef struct cmu_typedef CMU_TypeDef;

/// Declare peripheral structure for CRYPTOACC.
typedef struct cryptoacc_typedef CRYPTOACC_TypeDef;

/// Declare peripheral structure for CRYPTOACC_PKCTRL.
typedef struct cryptoacc_pkctrl_typedef CRYPTOACC_PKCTRL_TypeDef;

/// Declare peripheral structure for CRYPTOACC_RNGCTRL.
typedef struct cryptoacc_rngctrl_typedef CRYPTOACC_RNGCTRL_TypeDef;

/// Declare peripheral structure for DCDC.
typedef struct dcdc_typedef DCDC_TypeDef;

/// Declare peripheral structure for DEVINFO.
typedef struct devinfo_typedef DEVINFO_TypeDef;

/// Declare peripheral structure for DPLL.
typedef struct dpll_typedef DPLL_TypeDef;

/// Declare peripheral structure for EMU.
typedef struct emu_typedef EMU_TypeDef;

/// Declare peripheral structure for EMU_CFGNS.
typedef struct emu_cfgns_typedef EMU_CFGNS_TypeDef;

/// Declare peripheral structure for ETAMPDET.
typedef struct etampdet_typedef ETAMPDET_TypeDef;

/// Declare peripheral structure for EUSART.
typedef struct eusart_typedef EUSART_TypeDef;

/// Declare peripheral structure for FSRCO.
typedef struct fsrco_typedef FSRCO_TypeDef;

/// Declare peripheral structure for GPCRC.
typedef struct gpcrc_typedef GPCRC_TypeDef;

/// Declare peripheral structure for GPIO.
typedef struct gpio_typedef GPIO_TypeDef;

/// Declare peripheral structure for HFRCO.
typedef struct hfrco_typedef HFRCO_TypeDef;

/// Declare peripheral structure for HFXO.
typedef struct hfxo_typedef HFXO_TypeDef;

/// Declare peripheral structure for HOSTPORTAL.
typedef struct hostportal_typedef HOSTPORTAL_TypeDef;

/// Declare peripheral structure for HYDRARAM.
typedef struct hydraram_typedef HYDRARAM_TypeDef;

/// Declare peripheral structure for I2C.
typedef struct i2c_typedef I2C_TypeDef;

/// Declare peripheral structure for IADC.
typedef struct iadc_typedef IADC_TypeDef;

/// Declare peripheral structure for ICACHE.
typedef struct icache_typedef ICACHE_TypeDef;

/// Declare peripheral structure for KEYSCAN.
typedef struct keyscan_typedef KEYSCAN_TypeDef;

/// Declare peripheral structure for L2CACHE.
typedef struct l2cache_typedef L2CACHE_TypeDef;

/// Declare peripheral structure for LCD.
typedef struct lcd_typedef LCD_TypeDef;

/// Declare peripheral structure for LCDRF.
typedef struct lcdrf_typedef LCDRF_TypeDef;

/// Declare peripheral structure for LDMA.
typedef struct ldma_typedef LDMA_TypeDef;

/// Declare peripheral structure for LDMAXBAR.
typedef struct ldmaxbar_typedef LDMAXBAR_TypeDef;

/// Declare peripheral structure for LEDDRV.
typedef struct leddrv_typedef LEDDRV_TypeDef;

/// Declare peripheral structure for LESENSE.
typedef struct lesense_typedef LESENSE_TypeDef;

/// Declare peripheral structure for LETIMER.
typedef struct letimer_typedef LETIMER_TypeDef;

/// Declare peripheral structure for LFRCO.
typedef struct lfrco_typedef LFRCO_TypeDef;

/// Declare peripheral structure for LFXO.
typedef struct lfxo_typedef LFXO_TypeDef;

/// Declare peripheral structure for LPW0PORTAL.
typedef struct lpw0portal_typedef LPW0PORTAL_TypeDef;

/// Declare peripheral structure for LVGD.
typedef struct lvgd_typedef LVGD_TypeDef;

/// Declare peripheral structure for MAILBOX.
typedef struct mailbox_typedef MAILBOX_TypeDef;

/// Declare peripheral structure for MPAHBRAM.
typedef struct mpahbram_typedef MPAHBRAM_TypeDef;

/// Declare peripheral structure for MSC.
typedef struct msc_typedef MSC_TypeDef;

/// Declare peripheral structure for MVP.
typedef struct mvp_typedef MVP_TypeDef;

/// Declare peripheral structure for PCNT.
typedef struct pcnt_typedef PCNT_TypeDef;

/// Declare peripheral structure for PDM.
typedef struct pdm_typedef PDM_TypeDef;

/// Declare peripheral structure for PFMXPPRF.
typedef struct pfmxpprf_typedef PFMXPPRF_TypeDef;

/// Declare peripheral structure for PIXELRZ.
typedef struct pixelrz_typedef PIXELRZ_TypeDef;

/// Declare peripheral structure for PRS.
typedef struct prs_typedef PRS_TypeDef;

/// Declare peripheral structure for RFFPLL.
typedef struct rffpll_typedef RFFPLL_TypeDef;

/// Declare peripheral structure for RPA.
typedef struct rpa_typedef RPA_TypeDef;

/// Declare peripheral structure for RTCC.
typedef struct rtcc_typedef RTCC_TypeDef;

/// Declare peripheral structure for SCRATCHPAD.
typedef struct scratchpad_typedef SCRATCHPAD_TypeDef;

/// Declare peripheral structure for SEMAILBOX_AHBHOST.
typedef struct semailbox_ahbhost_typedef SEMAILBOX_AHBHOST_TypeDef;

/// Declare peripheral structure for SEMAILBOX_HOST.
typedef struct semailbox_host_typedef SEMAILBOX_HOST_TypeDef;

/// Declare peripheral structure for SEMAPHORE.
typedef struct semaphore_typedef SEMAPHORE_TypeDef;

/// Declare peripheral structure for SEPORTAL.
typedef struct seportal_typedef SEPORTAL_TypeDef;

/// Declare peripheral structure for SEPUF_APBCFG.
typedef struct sepuf_apbcfg_typedef SEPUF_APBCFG_TypeDef;

/// Declare peripheral structure for SOCPLL.
typedef struct socpll_typedef SOCPLL_TypeDef;

/// Declare peripheral structure for SYMCRYPTO.
typedef struct symcrypto_typedef SYMCRYPTO_TypeDef;

/// Declare peripheral structure for SYSCFG.
typedef struct syscfg_typedef SYSCFG_TypeDef;

/// Declare peripheral structure for SYSCFG_CFGNS.
typedef struct syscfg_cfgns_typedef SYSCFG_CFGNS_TypeDef;

/// Declare peripheral structure for SYSRTC.
typedef struct sysrtc_typedef SYSRTC_TypeDef;

/// Declare peripheral structure for TIMER.
typedef struct timer_typedef TIMER_TypeDef;

/// Declare peripheral structure for ULFRCO.
typedef struct ulfrco_typedef ULFRCO_TypeDef;

/// Declare peripheral structure for USART.
typedef struct usart_typedef USART_TypeDef;

