CiscoDevNet/csmp-agent-lib/efr32_wisun/gecko_sdk_2024.6.0/platform/service/device_manager/inc/sl_device_abstraction_peripheral.h
/// Declare peripheral structure for USBAHB_AHBS.
typedef struct usbahb_ahbs_typedef USBAHB_AHBS_TypeDef;

/// Declare peripheral structure for USBPLL.
typedef struct usbpll_typedef USBPLL_TypeDef;

/// Declare peripheral structure for USB_APBS.
typedef struct usb_apbs_typedef USB_APBS_TypeDef;

/// Declare peripheral structure for VDAC.
typedef struct vdac_typedef VDAC_TypeDef;

/// Declare peripheral structure for WDOG.
typedef struct wdog_typedef WDOG_TypeDef;

/*******************************************************************************
 *******************************   FUNCTIONS   *********************************
 ******************************************************************************/

/***************************************************************************//**
 * The base address getter for ACMP.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The base address of the peripheral.
 ******************************************************************************/
inline ACMP_TypeDef *sl_device_peripheral_acmp_get_base_addr(const sl_peripheral_t peripheral)
{
  return (ACMP_TypeDef *)peripheral->base;
}

/***************************************************************************//**
 * The base address getter for ADC.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The base address of the peripheral.
 ******************************************************************************/
inline ADC_TypeDef *sl_device_peripheral_adc_get_base_addr(const sl_peripheral_t peripheral)
{
  return (ADC_TypeDef *)peripheral->base;
}

/***************************************************************************//**
 * The base address getter for AES.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The base address of the peripheral.
 ******************************************************************************/
inline AES_TypeDef *sl_device_peripheral_aes_get_base_addr(const sl_peripheral_t peripheral)
{
  return (AES_TypeDef *)peripheral->base;
}

/***************************************************************************//**
 * The base address getter for AMUXCP.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The base address of the peripheral.
 ******************************************************************************/
inline AMUXCP_TypeDef *sl_device_peripheral_amuxcp_get_base_addr(const sl_peripheral_t peripheral)
{
  return (AMUXCP_TypeDef *)peripheral->base;
}

/***************************************************************************//**
 * The base address getter for BUFC.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The base address of the peripheral.
 ******************************************************************************/
inline BUFC_TypeDef *sl_device_peripheral_bufc_get_base_addr(const sl_peripheral_t peripheral)
{
  return (BUFC_TypeDef *)peripheral->base;
}

/***************************************************************************//**
 * The base address getter for BURAM.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The base address of the peripheral.
 ******************************************************************************/
inline BURAM_TypeDef *sl_device_peripheral_buram_get_base_addr(const sl_peripheral_t peripheral)
{
  return (BURAM_TypeDef *)peripheral->base;
}

/***************************************************************************//**
 * The base address getter for BURTC.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The base address of the peripheral.
 ******************************************************************************/
inline BURTC_TypeDef *sl_device_peripheral_burtc_get_base_addr(const sl_peripheral_t peripheral)
{
  return (BURTC_TypeDef *)peripheral->base;
}

/***************************************************************************//**
 * The base address getter for CMU.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The base address of the peripheral.
 ******************************************************************************/
inline CMU_TypeDef *sl_device_peripheral_cmu_get_base_addr(const sl_peripheral_t peripheral)
{
  return (CMU_TypeDef *)peripheral->base;
}

/***************************************************************************//**
 * The base address getter for CRYPTOACC.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The base address of the peripheral.
 ******************************************************************************/
inline CRYPTOACC_TypeDef *sl_device_peripheral_cryptoacc_get_base_addr(const sl_peripheral_t peripheral)
{
  return (CRYPTOACC_TypeDef *)peripheral->base;
}

/***************************************************************************//**
 * The base address getter for CRYPTOACC_PKCTRL.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The base address of the peripheral.
 ******************************************************************************/
inline CRYPTOACC_PKCTRL_TypeDef *sl_device_peripheral_cryptoacc_pkctrl_get_base_addr(const sl_peripheral_t peripheral)
{
  return (CRYPTOACC_PKCTRL_TypeDef *)peripheral->base;
}

/***************************************************************************//**
 * The base address getter for CRYPTOACC_RNGCTRL.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The base address of the peripheral.
 ******************************************************************************/
inline CRYPTOACC_RNGCTRL_TypeDef *sl_device_peripheral_cryptoacc_rngctrl_get_base_addr(const sl_peripheral_t peripheral)
{
  return (CRYPTOACC_RNGCTRL_TypeDef *)peripheral->base;
}

/***************************************************************************//**
 * The base address getter for DCDC.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The base address of the peripheral.
 ******************************************************************************/
inline DCDC_TypeDef *sl_device_peripheral_dcdc_get_base_addr(const sl_peripheral_t peripheral)
{
  return (DCDC_TypeDef *)peripheral->base;
}

/***************************************************************************//**
 * The base address getter for DEVINFO.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The base address of the peripheral.
 ******************************************************************************/
inline DEVINFO_TypeDef *sl_device_peripheral_devinfo_get_base_addr(const sl_peripheral_t peripheral)
{
  return (DEVINFO_TypeDef *)peripheral->base;
}

/***************************************************************************//**
 * The base address getter for DPLL.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The base address of the peripheral.
 ******************************************************************************/
inline DPLL_TypeDef *sl_device_peripheral_dpll_get_base_addr(const sl_peripheral_t peripheral)
{
  return (DPLL_TypeDef *)peripheral->base;
}

/***************************************************************************//**
 * The base address getter for EMU.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The base address of the peripheral.
 ******************************************************************************/
inline EMU_TypeDef *sl_device_peripheral_emu_get_base_addr(const sl_peripheral_t peripheral)
{
  return (EMU_TypeDef *)peripheral->base;
}

/***************************************************************************//**
 * The base address getter for EMU_CFGNS.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The base address of the peripheral.
 ******************************************************************************/
inline EMU_CFGNS_TypeDef *sl_device_peripheral_emu_cfgns_get_base_addr(const sl_peripheral_t peripheral)
{
  return (EMU_CFGNS_TypeDef *)peripheral->base;
}

/***************************************************************************//**
 * The base address getter for ETAMPDET.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The base address of the peripheral.
 ******************************************************************************/
inline ETAMPDET_TypeDef *sl_device_peripheral_etampdet_get_base_addr(const sl_peripheral_t peripheral)
{
  return (ETAMPDET_TypeDef *)peripheral->base;
}

/***************************************************************************//**
 * The base address getter for EUSART.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The base address of the peripheral.
 ******************************************************************************/
inline EUSART_TypeDef *sl_device_peripheral_eusart_get_base_addr(const sl_peripheral_t peripheral)
{
  return (EUSART_TypeDef *)peripheral->base;
}

/***************************************************************************//**
 * The base address getter for FSRCO.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The base address of the peripheral.
 ******************************************************************************/
inline FSRCO_TypeDef *sl_device_peripheral_fsrco_get_base_addr(const sl_peripheral_t peripheral)
{
  return (FSRCO_TypeDef *)peripheral->base;
}

/***************************************************************************//**
 * The base address getter for GPCRC.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The base address of the peripheral.
 ******************************************************************************/
inline GPCRC_TypeDef *sl_device_peripheral_gpcrc_get_base_addr(const sl_peripheral_t peripheral)
{
  return (GPCRC_TypeDef *)peripheral->base;
}

/***************************************************************************//**
 * The base address getter for GPIO.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The base address of the peripheral.
 ******************************************************************************/
inline GPIO_TypeDef *sl_device_peripheral_gpio_get_base_addr(const sl_peripheral_t peripheral)
{
  return (GPIO_TypeDef *)peripheral->base;
}

/***************************************************************************//**
 * The base address getter for HFRCO.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The base address of the peripheral.
 ******************************************************************************/
inline HFRCO_TypeDef *sl_device_peripheral_hfrco_get_base_addr(const sl_peripheral_t peripheral)
{
  return (HFRCO_TypeDef *)peripheral->base;
}

/***************************************************************************//**
 * The base address getter for HFXO.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The base address of the peripheral.
 ******************************************************************************/
inline HFXO_TypeDef *sl_device_peripheral_hfxo_get_base_addr(const sl_peripheral_t peripheral)
{
  return (HFXO_TypeDef *)peripheral->base;
}

/***************************************************************************//**
 * The base address getter for HOSTPORTAL.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The base address of the peripheral.
 ******************************************************************************/
inline HOSTPORTAL_TypeDef *sl_device_peripheral_hostportal_get_base_addr(const sl_peripheral_t peripheral)
{
  return (HOSTPORTAL_TypeDef *)peripheral->base;
}

/***************************************************************************//**
 * The base address getter for HYDRARAM.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The base address of the peripheral.
 ******************************************************************************/
inline HYDRARAM_TypeDef *sl_device_peripheral_hydraram_get_base_addr(const sl_peripheral_t peripheral)
{
  return (HYDRARAM_TypeDef *)peripheral->base;
}

/***************************************************************************//**
 * The base address getter for I2C.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The base address of the peripheral.
 ******************************************************************************/
inline I2C_TypeDef *sl_device_peripheral_i2c_get_base_addr(const sl_peripheral_t peripheral)
{
  return (I2C_TypeDef *)peripheral->base;
}

/***************************************************************************//**
 * The base address getter for IADC.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The base address of the peripheral.
 ******************************************************************************/
inline IADC_TypeDef *sl_device_peripheral_iadc_get_base_addr(const sl_peripheral_t peripheral)
{
  return (IADC_TypeDef *)peripheral->base;
}

/***************************************************************************//**
 * The base address getter for ICACHE.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The base address of the peripheral.
 ******************************************************************************/
inline ICACHE_TypeDef *sl_device_peripheral_icache_get_base_addr(const sl_peripheral_t peripheral)
{
  return (ICACHE_TypeDef *)peripheral->base;
}

/***************************************************************************//**
 * The base address getter for KEYSCAN.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The base address of the peripheral.
 ******************************************************************************/
inline KEYSCAN_TypeDef *sl_device_peripheral_keyscan_get_base_addr(const sl_peripheral_t peripheral)
{
  return (KEYSCAN_TypeDef *)peripheral->base;
}

/***************************************************************************//**
 * The base address getter for L2CACHE.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The base address of the peripheral.
 ******************************************************************************/
inline L2CACHE_TypeDef *sl_device_peripheral_l2cache_get_base_addr(const sl_peripheral_t peripheral)
{
  return (L2CACHE_TypeDef *)peripheral->base;
}

/***************************************************************************//**
 * The base address getter for LCD.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The base address of the peripheral.
 ******************************************************************************/
inline LCD_TypeDef *sl_device_peripheral_lcd_get_base_addr(const sl_peripheral_t peripheral)
{
  return (LCD_TypeDef *)peripheral->base;
}

/***************************************************************************//**
 * The base address getter for LCDRF.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The base address of the peripheral.
 ******************************************************************************/
inline LCDRF_TypeDef *sl_device_peripheral_lcdrf_get_base_addr(const sl_peripheral_t peripheral)
{
  return (LCDRF_TypeDef *)peripheral->base;
}

/***************************************************************************//**
 * The base address getter for LDMA.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The base address of the peripheral.
 ******************************************************************************/
inline LDMA_TypeDef *sl_device_peripheral_ldma_get_base_addr(const sl_peripheral_t peripheral)
{
  return (LDMA_TypeDef *)peripheral->base;
}

/***************************************************************************//**
 * The base address getter for LDMAXBAR.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The base address of the peripheral.
 ******************************************************************************/
inline LDMAXBAR_TypeDef *sl_device_peripheral_ldmaxbar_get_base_addr(const sl_peripheral_t peripheral)
{
  return (LDMAXBAR_TypeDef *)peripheral->base;
}

/***************************************************************************//**
 * The base address getter for LEDDRV.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The base address of the peripheral.
 ******************************************************************************/
inline LEDDRV_TypeDef *sl_device_peripheral_leddrv_get_base_addr(const sl_peripheral_t peripheral)
{
  return (LEDDRV_TypeDef *)peripheral->base;
}

/***************************************************************************//**
 * The base address getter for LESENSE.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The base address of the peripheral.
 ******************************************************************************/
inline LESENSE_TypeDef *sl_device_peripheral_lesense_get_base_addr(const sl_peripheral_t peripheral)
{
  return (LESENSE_TypeDef *)peripheral->base;
}

/***************************************************************************//**
 * The base address getter for LETIMER.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The base address of the peripheral.
 ******************************************************************************/
inline LETIMER_TypeDef *sl_device_peripheral_letimer_get_base_addr(const sl_peripheral_t peripheral)
{
  return (LETIMER_TypeDef *)peripheral->base;
}

/***************************************************************************//**
 * The base address getter for LFRCO.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The base address of the peripheral.
 ******************************************************************************/
inline LFRCO_TypeDef *sl_device_peripheral_lfrco_get_base_addr(const sl_peripheral_t peripheral)
{
  return (LFRCO_TypeDef *)peripheral->base;
}

/***************************************************************************//**
 * The base address getter for LFXO.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The base address of the peripheral.
 ******************************************************************************/
inline LFXO_TypeDef *sl_device_peripheral_lfxo_get_base_addr(const sl_peripheral_t peripheral)
{
  return (LFXO_TypeDef *)peripheral->base;
}

/***************************************************************************//**
 * The base address getter for LPW0PORTAL.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The base address of the peripheral.
 ******************************************************************************/
inline LPW0PORTAL_TypeDef *sl_device_peripheral_lpw0portal_get_base_addr(const sl_peripheral_t peripheral)
{
  return (LPW0PORTAL_TypeDef *)peripheral->base;
}

/***************************************************************************//**
 * The base address getter for LVGD.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The base address of the peripheral.
 ******************************************************************************/
inline LVGD_TypeDef *sl_device_peripheral_lvgd_get_base_addr(const sl_peripheral_t peripheral)
{
  return (LVGD_TypeDef *)peripheral->base;
}

/***************************************************************************//**
 * The base address getter for MAILBOX.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The base address of the peripheral.
 ******************************************************************************/
inline MAILBOX_TypeDef *sl_device_peripheral_mailbox_get_base_addr(const sl_peripheral_t peripheral)
{
  return (MAILBOX_TypeDef *)peripheral->base;
}

/***************************************************************************//**
 * The base address getter for MPAHBRAM.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The base address of the peripheral.
 ******************************************************************************/
inline MPAHBRAM_TypeDef *sl_device_peripheral_mpahbram_get_base_addr(const sl_peripheral_t peripheral)
{
  return (MPAHBRAM_TypeDef *)peripheral->base;
}

/***************************************************************************//**
 * The base address getter for MSC.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The base address of the peripheral.
 ******************************************************************************/
inline MSC_TypeDef *sl_device_peripheral_msc_get_base_addr(const sl_peripheral_t peripheral)
{
  return (MSC_TypeDef *)peripheral->base;
}

/***************************************************************************//**
 * The base address getter for MVP.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The base address of the peripheral.
 ******************************************************************************/
inline MVP_TypeDef *sl_device_peripheral_mvp_get_base_addr(const sl_peripheral_t peripheral)
{
  return (MVP_TypeDef *)peripheral->base;
}

/***************************************************************************//**
 * The base address getter for PCNT.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The base address of the peripheral.
 ******************************************************************************/
inline PCNT_TypeDef *sl_device_peripheral_pcnt_get_base_addr(const sl_peripheral_t peripheral)
{
  return (PCNT_TypeDef *)peripheral->base;
}

/***************************************************************************//**
 * The base address getter for PDM.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The base address of the peripheral.
 ******************************************************************************/
inline PDM_TypeDef *sl_device_peripheral_pdm_get_base_addr(const sl_peripheral_t peripheral)
{
  return (PDM_TypeDef *)peripheral->base;
}

/***************************************************************************//**
 * The base address getter for PFMXPPRF.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The base address of the peripheral.
 ******************************************************************************/
inline PFMXPPRF_TypeDef *sl_device_peripheral_pfmxpprf_get_base_addr(const sl_peripheral_t peripheral)
{
  return (PFMXPPRF_TypeDef *)peripheral->base;
}

/***************************************************************************//**
 * The base address getter for PIXELRZ.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The base address of the peripheral.
 ******************************************************************************/
inline PIXELRZ_TypeDef *sl_device_peripheral_pixelrz_get_base_addr(const sl_peripheral_t peripheral)
{
  return (PIXELRZ_TypeDef *)peripheral->base;
}

/***************************************************************************//**
 * The base address getter for PRS.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The base address of the peripheral.
 ******************************************************************************/
inline PRS_TypeDef *sl_device_peripheral_prs_get_base_addr(const sl_peripheral_t peripheral)
{
  return (PRS_TypeDef *)peripheral->base;
}

/***************************************************************************//**
 * The base address getter for RFFPLL.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The base address of the peripheral.
 ******************************************************************************/
inline RFFPLL_TypeDef *sl_device_peripheral_rffpll_get_base_addr(const sl_peripheral_t peripheral)
{
  return (RFFPLL_TypeDef *)peripheral->base;
}

