CiscoDevNet/csmp-agent-lib/efr32_wisun/gecko_sdk_2024.6.0/platform/service/device_manager/inc/sl_device_abstraction_peripheral.h
/***************************************************************************//**
 * The base address getter for RPA.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The base address of the peripheral.
 ******************************************************************************/
inline RPA_TypeDef *sl_device_peripheral_rpa_get_base_addr(const sl_peripheral_t peripheral)
{
  return (RPA_TypeDef *)peripheral->base;
}

/***************************************************************************//**
 * The base address getter for RTCC.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The base address of the peripheral.
 ******************************************************************************/
inline RTCC_TypeDef *sl_device_peripheral_rtcc_get_base_addr(const sl_peripheral_t peripheral)
{
  return (RTCC_TypeDef *)peripheral->base;
}

/***************************************************************************//**
 * The base address getter for SCRATCHPAD.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The base address of the peripheral.
 ******************************************************************************/
inline SCRATCHPAD_TypeDef *sl_device_peripheral_scratchpad_get_base_addr(const sl_peripheral_t peripheral)
{
  return (SCRATCHPAD_TypeDef *)peripheral->base;
}

/***************************************************************************//**
 * The base address getter for SEMAILBOX_AHBHOST.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The base address of the peripheral.
 ******************************************************************************/
inline SEMAILBOX_AHBHOST_TypeDef *sl_device_peripheral_semailbox_ahbhost_get_base_addr(const sl_peripheral_t peripheral)
{
  return (SEMAILBOX_AHBHOST_TypeDef *)peripheral->base;
}

/***************************************************************************//**
 * The base address getter for SEMAILBOX_HOST.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The base address of the peripheral.
 ******************************************************************************/
inline SEMAILBOX_HOST_TypeDef *sl_device_peripheral_semailbox_host_get_base_addr(const sl_peripheral_t peripheral)
{
  return (SEMAILBOX_HOST_TypeDef *)peripheral->base;
}

/***************************************************************************//**
 * The base address getter for SEMAPHORE.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The base address of the peripheral.
 ******************************************************************************/
inline SEMAPHORE_TypeDef *sl_device_peripheral_semaphore_get_base_addr(const sl_peripheral_t peripheral)
{
  return (SEMAPHORE_TypeDef *)peripheral->base;
}

/***************************************************************************//**
 * The base address getter for SEPORTAL.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The base address of the peripheral.
 ******************************************************************************/
inline SEPORTAL_TypeDef *sl_device_peripheral_seportal_get_base_addr(const sl_peripheral_t peripheral)
{
  return (SEPORTAL_TypeDef *)peripheral->base;
}

/***************************************************************************//**
 * The base address getter for SEPUF_APBCFG.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The base address of the peripheral.
 ******************************************************************************/
inline SEPUF_APBCFG_TypeDef *sl_device_peripheral_sepuf_apbcfg_get_base_addr(const sl_peripheral_t peripheral)
{
  return (SEPUF_APBCFG_TypeDef *)peripheral->base;
}

/***************************************************************************//**
 * The base address getter for SOCPLL.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The base address of the peripheral.
 ******************************************************************************/
inline SOCPLL_TypeDef *sl_device_peripheral_socpll_get_base_addr(const sl_peripheral_t peripheral)
{
  return (SOCPLL_TypeDef *)peripheral->base;
}

/***************************************************************************//**
 * The base address getter for SYMCRYPTO.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The base address of the peripheral.
 ******************************************************************************/
inline SYMCRYPTO_TypeDef *sl_device_peripheral_symcrypto_get_base_addr(const sl_peripheral_t peripheral)
{
  return (SYMCRYPTO_TypeDef *)peripheral->base;
}

/***************************************************************************//**
 * The base address getter for SYSCFG.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The base address of the peripheral.
 ******************************************************************************/
inline SYSCFG_TypeDef *sl_device_peripheral_syscfg_get_base_addr(const sl_peripheral_t peripheral)
{
  return (SYSCFG_TypeDef *)peripheral->base;
}

/***************************************************************************//**
 * The base address getter for SYSCFG_CFGNS.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The base address of the peripheral.
 ******************************************************************************/
inline SYSCFG_CFGNS_TypeDef *sl_device_peripheral_syscfg_cfgns_get_base_addr(const sl_peripheral_t peripheral)
{
  return (SYSCFG_CFGNS_TypeDef *)peripheral->base;
}

/***************************************************************************//**
 * The base address getter for SYSRTC.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The base address of the peripheral.
 ******************************************************************************/
inline SYSRTC_TypeDef *sl_device_peripheral_sysrtc_get_base_addr(const sl_peripheral_t peripheral)
{
  return (SYSRTC_TypeDef *)peripheral->base;
}

/***************************************************************************//**
 * The base address getter for TIMER.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The base address of the peripheral.
 ******************************************************************************/
inline TIMER_TypeDef *sl_device_peripheral_timer_get_base_addr(const sl_peripheral_t peripheral)
{
  return (TIMER_TypeDef *)peripheral->base;
}

/***************************************************************************//**
 * The base address getter for ULFRCO.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The base address of the peripheral.
 ******************************************************************************/
inline ULFRCO_TypeDef *sl_device_peripheral_ulfrco_get_base_addr(const sl_peripheral_t peripheral)
{
  return (ULFRCO_TypeDef *)peripheral->base;
}

/***************************************************************************//**
 * The base address getter for USART.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The base address of the peripheral.
 ******************************************************************************/
inline USART_TypeDef *sl_device_peripheral_usart_get_base_addr(const sl_peripheral_t peripheral)
{
  return (USART_TypeDef *)peripheral->base;
}

/***************************************************************************//**
 * The base address getter for USBAHB_AHBS.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The base address of the peripheral.
 ******************************************************************************/
inline USBAHB_AHBS_TypeDef *sl_device_peripheral_usbahb_ahbs_get_base_addr(const sl_peripheral_t peripheral)
{
  return (USBAHB_AHBS_TypeDef *)peripheral->base;
}

/***************************************************************************//**
 * The base address getter for USBPLL.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The base address of the peripheral.
 ******************************************************************************/
inline USBPLL_TypeDef *sl_device_peripheral_usbpll_get_base_addr(const sl_peripheral_t peripheral)
{
  return (USBPLL_TypeDef *)peripheral->base;
}

/***************************************************************************//**
 * The base address getter for USB_APBS.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The base address of the peripheral.
 ******************************************************************************/
inline USB_APBS_TypeDef *sl_device_peripheral_usb_apbs_get_base_addr(const sl_peripheral_t peripheral)
{
  return (USB_APBS_TypeDef *)peripheral->base;
}

/***************************************************************************//**
 * The base address getter for VDAC.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The base address of the peripheral.
 ******************************************************************************/
inline VDAC_TypeDef *sl_device_peripheral_vdac_get_base_addr(const sl_peripheral_t peripheral)
{
  return (VDAC_TypeDef *)peripheral->base;
}

/***************************************************************************//**
 * The base address getter for WDOG.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The base address of the peripheral.
 ******************************************************************************/
inline WDOG_TypeDef *sl_device_peripheral_wdog_get_base_addr(const sl_peripheral_t peripheral)
{
  return (WDOG_TypeDef *)peripheral->base;
}

/***************************************************************************//**
 * The clock branch getter.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The clock branch of the peripheral.
 ******************************************************************************/
inline sl_clock_branch_t sl_device_peripheral_get_clock_branch(const sl_peripheral_t peripheral)
{
  return peripheral->clk_branch;
}

/***************************************************************************//**
 * The bus clock getter.
 *
 * @param peripheral  A pointer to peripheral.
 *
 * @return  The bus clock of the peripheral.
 ******************************************************************************/
inline sl_bus_clock_t sl_device_peripheral_get_bus_clock(const sl_peripheral_t peripheral)
{
  return peripheral->bus_clock;
}

/** @} (end addtogroup device_abstraction_peripheral) */

#ifdef __cplusplus
}
#endif

#endif // SL_DEVICE_ABSTRACTION_PERIPHERAL_H
